assignment-18/assignment.tex
% Created 2016-06-19 Sun 00:15
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage{commath}
\usepackage{pgf}
\usepackage{tikz}
\usetikzlibrary{shapes, arrows}
\usepackage{marginnote}
\usepackage{listings}
\usepackage{enumerate}
\usepackage{algpseudocode}
\usepackage{algorithm}
\usepackage{mathtools}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\renewcommand{\arraystretch}{1.6}
\author{Oleg Sivokon}
\date{\textit{<2016-06-18 Sat>}}
\title{Assignment 17, Data-Structures}
\hypersetup{
  pdfkeywords={Data-Structures, Algorithms, Assignment},
  pdfsubject={Third assignment in the course Data-Structures},
  pdfcreator={Emacs 25.1.50.2 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\definecolor{codestr}{rgb}{0.46,0.09,0.2}
\lstset{%
  backgroundcolor=\color{codebg},
  basicstyle=\ttfamily\scriptsize,
  breakatwhitespace=false,
  breaklines=false,
  captionpos=b,
  framexleftmargin=10pt,
  xleftmargin=10pt,
  framerule=0pt,
  frame=tb,
  keepspaces=true,
  keywordstyle=\color{blue},
  showspaces=false,
  showstringspaces=false,
  showtabs=false,
  stringstyle=\color{codestr},
  tabsize=2
}
\lstnewenvironment{maxima}{%
  \lstset{%
    backgroundcolor=\color{codebg},
    escapeinside={(*@}{@*)},
    aboveskip=20pt,
    captionpos=b,
    label=,
    caption=,
    showstringspaces=false,
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\clearpage

\section{Problems}
\label{sec-1}

\subsection{Problem 1}
\label{sec-1-1}
Given integer $n$, suggest data-structure $S$ with following properties:
\begin{enumerate}
\item \texttt{build} takes $O(n \lg n)$ time.
\item \texttt{insert} takes $O(\lg n + d)$ time.
\item \texttt{delete} takes $O(\lg n + d)$ time.
\item \texttt{successor} takes $O(1)$ time.
\end{enumerate}

There was a descritption of what $d$ is, but it uses some runic Hebrew, and
is impossible to decypher.  I'll ignore it.

\subsubsection{Answer 1}
\label{sec-1-1-1}


\subsection{Problem 2}
\label{sec-1-2}
Does there exist a red-black tree s.t.:
\begin{enumerate}
\item It contains 3 black and 4 red nodes.
\item It contains 4 black and 3 red nodes.
\item It contains 5 black and 2 red nodes.
\item It contains 6 black and 1 red node.
\end{enumerate}

\subsubsection{Answer 2}
\label{sec-1-2-1}
Yes, this configuration is possible.  Consider root black node with two
black children.  Each child of the second level has only red nodes.  In this
tree all simple paths have the same number of black nodes.  All red nodes
have black children (leafs).

\subsubsection{Answer 3}
\label{sec-1-2-2}
Such tree is impossible.  Since the root node must be black, we should have
to place 3 remaining black nodes on two paths from the root to the leafs,
but we cannot divide 3 evenly in two paths.  And since we cannot, we would
have to violate the tree property which requires the same number of black
nodes on all simple paths from root to be the same.

\subsubsection{Answer 4}
\label{sec-1-2-3}
Yes, such tree is possible: black root node with two red children and four
black grandchildren.  Each simple path from root has two black nodes.  No
red node is a parent of another red node.

\subsubsection{Answer 5}
\label{sec-1-2-4}
No, such tree is impossible.  The number of black nodes in a red-black tree
must be odd (the root and two sub-trees with equal number of black nodes).

\subsection{Problem 3}
\label{sec-1-3}
Suggest data-structure which allows the following operations:
\begin{enumerate}
\item \texttt{insert} in time $O(\lg n)$.
\item \texttt{delete} in time $O(\lg n)$.
\item \texttt{pair-diff} \emph{(find two numbers which differ precisely by given amount)}
      in time $O(n)$.
\item \texttt{sum} \emph{(sums all numbers within given range)} in time $O(\lg n)$.
\end{enumerate}

\subsubsection{Answer 6}
\label{sec-1-3-1}

\subsection{Problem 4}
\label{sec-1-4}
Suggest data-structure which allows the following operations:
\begin{enumerate}
\item \texttt{search} in time $O(\lg n)$.
\item \texttt{insert} in time $O(\lg n)$.
\item \texttt{delete} in time $O(\lg n)$.
\item \texttt{mode} in time $O(1)$.
\item \texttt{mark} \emph{(insetion time)} in $O(\lg n)$.
\end{enumerate}

\subsubsection{Answer 7}
\label{sec-1-4-1}
% Emacs 25.1.50.2 (Org mode 8.2.10)
\end{document}